import os

BOT_TOKEN = os.environ.get("BALE_BOT_TOKEN", "2038041870:EiiTT0OTB5ocaI7lI-g6rofplgSMzsDBF3c")
BALE_BASE_URL = "https://tapi.bale.ai/bot"

SUPER_ADMIN_IDS = [1701430480]

MIN_COURSE_COUNT = 1
MAX_COURSE_COUNT = 7

NOTICE_TEXT = (
    "📌 به هنگام تنظیم جدول رعایت نکات زیر ضروری می‌باشد:\n\n"
    "۱ – برای همکاران موظف، روزهای پیشنهادی برای تدریس کمتر از سه روز کامل نباشد.\n\n"
    "۲ - در هنگام برنامه‌ریزی، اولویت با زمان‌های پیشنهادی صبح همکاران خواهد بود.\n\n"
    "۳ - ارائه حداقل یک روز برنامه در صبح، برای اساتید حق‌التدریس الزامی است.\n\n"
    "۴ - نوشتن نام دروس پیشنهادی دلالت بر اولویت انتخاب نخواهد داشت.\n\n"
    "۵ - استاد محترم، تحویل فرم روز پیشنهادی ضامن حضور در نیمسال فوق نخواهد بود، "
    "لذا عواملی همچون: نظر مدیرگروه، ارزشیابی، حضور و غیاب، فراوانی دروس مورد نظر و "
    "آیین‌نامه‌ها و بخشنامه‌های ابلاغی، در این امر تأثیرگذار خواهند بود. "
    "(داشتن گواهی صلاحیت تدریس الزامی و ضروری می‌باشد.)"
)

RETIRED_YES = "✅ بله"
RETIRED_NO  = "❌ خیر"

DEPARTMENTS = [
    "کامپیوتر",
    "برق",
    "مکانیک",
    "شیمیایی",
    "تربیت بدنی",
    "عمران",
    "معماری",
    "چوب",
    "علوم پایه و عمومی",
]

DAYS = ["شنبه", "یک‌شنبه", "دوشنبه", "سه‌شنبه", "چهارشنبه",]

# HOURS = [
#     "۸:۰۰ - ۹:۳۰",
#     "۹:۳۰ - ۱۱:۰۰",
#     "۱۱:۰۰ - ۱۲:۳۰",
#     "۱۳:۳۰ - ۱۵:۰۰",
#     "۱۵:۰۰ - ۱۶:۳۰",
#     "۱۶:۳۰ - ۱۸:۰۰",
# ]
